<a href="https://colab.research.google.com/github/Kaniz20/Python_Basics_Libraries_Guide/blob/main/Titanic_Data_Analysis_%26_Visualization_with_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
# IMPORTANT: SOME KAGGLE DATA SOURCES ARE PRIVATE
# RUN THIS CELL IN ORDER TO IMPORT YOUR KAGGLE DATA SOURCES.
import kagglehub
kagglehub.login()

In [ ]:
# IMPORTANT: RUN THIS CELL IN ORDER TO IMPORT YOUR KAGGLE DATA SOURCES,
# THEN FEEL FREE TO DELETE THIS CELL.
# NOTE: THIS NOTEBOOK ENVIRONMENT DIFFERS FROM KAGGLE'S PYTHON
# ENVIRONMENT SO THERE MAY BE MISSING LIBRARIES USED BY YOUR
# NOTEBOOK.

titanic_path = kagglehub.competition_download('titanic')

print('Data source import complete.')

In [ ]:
#Import library
import pandas as pd

In [ ]:
train=pd.read_csv("/kaggle/input/titanic/train.csv")

In [ ]:
df=train.copy()

In [ ]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [ ]:
df.head(10)

/usr/local/lib/python3.11/dist-packages/pandas/io/formats/format.py:1458: RuntimeWarning: invalid value encountered in greater
  has_large_values = (abs_vals > 1e6).any()
/usr/local/lib/python3.11/dist-packages/pandas/io/formats/format.py:1459: RuntimeWarning: invalid value encountered in less
  has_small_values = ((abs_vals < 10 ** (-self.digits)) & (abs_vals > 0)).any()
/usr/local/lib/python3.11/dist-packages/pandas/io/formats/format.py:1459: RuntimeWarning: invalid value encountered in greater
  has_small_values = ((abs_vals < 10 ** (-self.digits)) & (abs_vals > 0)).any()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [ ]:
df.tail()

/usr/local/lib/python3.11/dist-packages/pandas/io/formats/format.py:1458: RuntimeWarning: invalid value encountered in greater
  has_large_values = (abs_vals > 1e6).any()
/usr/local/lib/python3.11/dist-packages/pandas/io/formats/format.py:1459: RuntimeWarning: invalid value encountered in less
  has_small_values = ((abs_vals < 10 ** (-self.digits)) & (abs_vals > 0)).any()
/usr/local/lib/python3.11/dist-packages/pandas/io/formats/format.py:1459: RuntimeWarning: invalid value encountered in greater
  has_small_values = ((abs_vals < 10 ** (-self.digits)) & (abs_vals > 0)).any()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [ ]:
df.shape

(891, 12)

In [ ]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [ ]:
df["Pclass"]

0      3
1      1
2      3
3      1
4      3
      ..
886    2
887    1
888    3
889    1
890    3
Name: Pclass, Length: 891, dtype: int64

In [ ]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

# Create data frame

In [ ]:
dic={
    "Name":["Kaniz","Fatema","Anika","Jitu","Nabila"],
    "Age":[22,23,25,28,30],
    "ID":[102,103,105,106,101]
}

In [ ]:
data_frame=pd.DataFrame(dic)

In [ ]:
data_frame.describe()

             Age          ID
count   5.000000    5.000000
mean   25.600000  103.400000
std     3.361547    2.073644
min    22.000000  101.000000
25%    23.000000  102.000000
50%    25.000000  103.000000
75%    28.000000  105.000000
max    30.000000  106.000000

In [ ]:
data_frame.head()

     Name  Age   ID
0   Kaniz   22  102
1  Fatema   23  103
2   Anika   25  105
3    Jitu   28  106
4  Nabila   30  101

In [ ]:
data_frame.columns

Index(['Name', 'Age', 'ID'], dtype='object')

In [ ]:
data_frame.shape

(5, 3)

# Null value Handling

In [ ]:
df.isnull()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,True,False
887,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,False,False,True,False,False,False,False,True,False
889,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,True,False

In [ ]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [ ]:
null_value=df["Age"].mean()

In [ ]:
df.fillna(null_value,inplace=True)

In [ ]:
df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.000000,1,0,A/5 21171,7.2500,29.699118,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.000000,0,0,STON/O2. 3101282,7.9250,29.699118,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.000000,0,0,373450,8.0500,29.699118,S
5,6,0,3,"Moran, Mr. James",male,29.699118,0,0,330877,8.4583,29.699118,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.000000,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.000000,3,1,349909,21.0750,29.699118,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.000000,0,2,347742,11.1333,29.699118,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.000000,1,0,237736,30.0708,29.699118,C

# Convert Numerical value

In [ ]:
convert={"male":1,"female":0}

In [ ]:
df["Sex"]=df["Sex"].map(convert)

In [ ]:
df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",1,22.000000,1,0,A/5 21171,7.2500,29.699118,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.000000,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",0,26.000000,0,0,STON/O2. 3101282,7.9250,29.699118,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.000000,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",1,35.000000,0,0,373450,8.0500,29.699118,S
5,6,0,3,"Moran, Mr. James",1,29.699118,0,0,330877,8.4583,29.699118,Q
6,7,0,1,"McCarthy, Mr. Timothy J",1,54.000000,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",1,2.000000,3,1,349909,21.0750,29.699118,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",0,27.000000,0,2,347742,11.1333,29.699118,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",0,14.000000,1,0,237736,30.0708,29.699118,C

# Add New Column(s)

In [ ]:
L=lambda x:x.split()[0]

In [ ]:
df["Last Name"]=df["Name"].apply(L)

In [ ]:
F=lambda x:x.split()[1]

In [ ]:
df["First name"]=df["Name"].apply(F)

In [ ]:
df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Last Name,First name
0,1,0,3,"Braund, Mr. Owen Harris",1,22.000000,1,0,A/5 21171,7.2500,29.699118,S,"Braund,",Mr.
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.000000,1,0,PC 17599,71.2833,C85,C,"Cumings,",Mrs.
2,3,1,3,"Heikkinen, Miss. Laina",0,26.000000,0,0,STON/O2. 3101282,7.9250,29.699118,S,"Heikkinen,",Miss.
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.000000,1,0,113803,53.1000,C123,S,"Futrelle,",Mrs.
4,5,0,3,"Allen, Mr. William Henry",1,35.000000,0,0,373450,8.0500,29.699118,S,"Allen,",Mr.
5,6,0,3,"Moran, Mr. James",1,29.699118,0,0,330877,8.4583,29.699118,Q,"Moran,",Mr.
6,7,0,1,"McCarthy, Mr. Timothy J",1,54.000000,0,0,17463,51.8625,E46,S,"McCarthy,",Mr.
7,8,0,3,"Palsson, Master. Gosta Leonard",1,2.000000,3,1,349909,21.0750,29.699118,S,"Palsson,",Master.
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",0,27.000000,0,2,347742,11.1333,29.699118,S,"Johnson,",Mrs.
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",0,14.000000,1,0,237736,30.0708,29.699118,C,"Nasser,",Mrs.

# Two Column Add

In [ ]:
#3rd class---male passenger
df["Third&Men"]=((df["Pclass"]==3) & (df["Sex"]==1)).astype(int)

In [ ]:
df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Last Name,First name,Third&Men
0,1,0,3,"Braund, Mr. Owen Harris",1,22.000000,1,0,A/5 21171,7.2500,29.699118,S,"Braund,",Mr.,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.000000,1,0,PC 17599,71.2833,C85,C,"Cumings,",Mrs.,0
2,3,1,3,"Heikkinen, Miss. Laina",0,26.000000,0,0,STON/O2. 3101282,7.9250,29.699118,S,"Heikkinen,",Miss.,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.000000,1,0,113803,53.1000,C123,S,"Futrelle,",Mrs.,0
4,5,0,3,"Allen, Mr. William Henry",1,35.000000,0,0,373450,8.0500,29.699118,S,"Allen,",Mr.,1
5,6,0,3,"Moran, Mr. James",1,29.699118,0,0,330877,8.4583,29.699118,Q,"Moran,",Mr.,1
6,7,0,1,"McCarthy, Mr. Timothy J",1,54.000000,0,0,17463,51.8625,E46,S,"McCarthy,",Mr.,0
7,8,0,3,"Palsson, Master. Gosta Leonard",1,2.000000,3,1,349909,21.0750,29.699118,S,"Palsson,",Master.,1
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",0,27.000000,0,2,347742,11.1333,29.699118,S,"Johnson,",Mrs.,0
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",0,14.000000,1,0,237736,30.0708,29.699118,C,"Nasser,",Mrs.,0

In [ ]:
def age_group(age):
    if age < 18:
        return 1
    elif age >= 18 and age < 40:
        return 2
    elif age >= 40 and age < 60:
        return 3
    else:
        return 4

df["Age Group"] = df["Age"].apply(age_group)

In [ ]:
df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Last Name,First name,Third&Men,Age Group
0,1,0,3,"Braund, Mr. Owen Harris",1,22.000000,1,0,A/5 21171,7.2500,29.699118,S,"Braund,",Mr.,1,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.000000,1,0,PC 17599,71.2833,C85,C,"Cumings,",Mrs.,0,2
2,3,1,3,"Heikkinen, Miss. Laina",0,26.000000,0,0,STON/O2. 3101282,7.9250,29.699118,S,"Heikkinen,",Miss.,0,2
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.000000,1,0,113803,53.1000,C123,S,"Futrelle,",Mrs.,0,2
4,5,0,3,"Allen, Mr. William Henry",1,35.000000,0,0,373450,8.0500,29.699118,S,"Allen,",Mr.,1,2
5,6,0,3,"Moran, Mr. James",1,29.699118,0,0,330877,8.4583,29.699118,Q,"Moran,",Mr.,1,2
6,7,0,1,"McCarthy, Mr. Timothy J",1,54.000000,0,0,17463,51.8625,E46,S,"McCarthy,",Mr.,0,3
7,8,0,3,"Palsson, Master. Gosta Leonard",1,2.000000,3,1,349909,21.0750,29.699118,S,"Palsson,",Master.,1,1
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",0,27.000000,0,2,347742,11.1333,29.699118,S,"Johnson,",Mrs.,0,2
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",0,14.000000,1,0,237736,30.0708,29.699118,C,"Nasser,",Mrs.,0,1

# Delete Column(s)

In [ ]:
df=df.drop(["PassengerId"],axis=1)

In [ ]:
df.head(10)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Last Name,First name,Third&Men,Age Group
0,0,3,"Braund, Mr. Owen Harris",1,22.000000,1,0,A/5 21171,7.2500,29.699118,S,"Braund,",Mr.,1,2
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.000000,1,0,PC 17599,71.2833,C85,C,"Cumings,",Mrs.,0,2
2,1,3,"Heikkinen, Miss. Laina",0,26.000000,0,0,STON/O2. 3101282,7.9250,29.699118,S,"Heikkinen,",Miss.,0,2
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.000000,1,0,113803,53.1000,C123,S,"Futrelle,",Mrs.,0,2
4,0,3,"Allen, Mr. William Henry",1,35.000000,0,0,373450,8.0500,29.699118,S,"Allen,",Mr.,1,2
5,0,3,"Moran, Mr. James",1,29.699118,0,0,330877,8.4583,29.699118,Q,"Moran,",Mr.,1,2
6,0,1,"McCarthy, Mr. Timothy J",1,54.000000,0,0,17463,51.8625,E46,S,"McCarthy,",Mr.,0,3
7,0,3,"Palsson, Master. Gosta Leonard",1,2.000000,3,1,349909,21.0750,29.699118,S,"Palsson,",Master.,1,1
8,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",0,27.000000,0,2,347742,11.1333,29.699118,S,"Johnson,",Mrs.,0,2
9,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",0,14.000000,1,0,237736,30.0708,29.699118,C,"Nasser,",Mrs.,0,1

In [ ]:
re_name={"Sex":"Gender","Name":"Full Name"}
df=df.rename(columns=re_name)

In [ ]:
df.head(10)

,Survived,Pclass,Full Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Last Name,First name,Third&Men,Age Group
0,0,3,"Braund, Mr. Owen Harris",1,22.000000,1,0,A/5 21171,7.2500,29.699118,S,"Braund,",Mr.,1,2
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.000000,1,0,PC 17599,71.2833,C85,C,"Cumings,",Mrs.,0,2
2,1,3,"Heikkinen, Miss. Laina",0,26.000000,0,0,STON/O2. 3101282,7.9250,29.699118,S,"Heikkinen,",Miss.,0,2
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.000000,1,0,113803,53.1000,C123,S,"Futrelle,",Mrs.,0,2
4,0,3,"Allen, Mr. William Henry",1,35.000000,0,0,373450,8.0500,29.699118,S,"Allen,",Mr.,1,2
5,0,3,"Moran, Mr. James",1,29.699118,0,0,330877,8.4583,29.699118,Q,"Moran,",Mr.,1,2
6,0,1,"McCarthy, Mr. Timothy J",1,54.000000,0,0,17463,51.8625,E46,S,"McCarthy,",Mr.,0,3
7,0,3,"Palsson, Master. Gosta Leonard",1,2.000000,3,1,349909,21.0750,29.699118,S,"Palsson,",Master.,1,1
8,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",0,27.000000,0,2,347742,11.1333,29.699118,S,"Johnson,",Mrs.,0,2
9,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",0,14.000000,1,0,237736,30.0708,29.699118,C,"Nasser,",Mrs.,0,1

In [ ]:
df[((df["Age"]>60) & (df["Gender"]==0))]

,Survived,Pclass,Full Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Last Name,First name,Third&Men,Age Group
275,1,1,"Andrews, Miss. Kornelia Theodosia",0,63.0,1,0,13502,77.9583,D7,S,"Andrews,",Miss.,0,4
483,1,3,"Turkula, Mrs. (Hedwig)",0,63.0,0,0,4134,9.5875,29.699118,S,"Turkula,",Mrs.,0,4
829,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",0,62.0,0,0,113572,80.0000,B28,29.699118,"Stone,",Mrs.,0,4

# Filter Numeric & Categorical Feature

In [ ]:
df.head(10)

,Survived,Pclass,Full Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Last Name,First name,Third&Men,Age Group
0,0,3,"Braund, Mr. Owen Harris",1,22.000000,1,0,A/5 21171,7.2500,29.699118,S,"Braund,",Mr.,1,2
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.000000,1,0,PC 17599,71.2833,C85,C,"Cumings,",Mrs.,0,2
2,1,3,"Heikkinen, Miss. Laina",0,26.000000,0,0,STON/O2. 3101282,7.9250,29.699118,S,"Heikkinen,",Miss.,0,2
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.000000,1,0,113803,53.1000,C123,S,"Futrelle,",Mrs.,0,2
4,0,3,"Allen, Mr. William Henry",1,35.000000,0,0,373450,8.0500,29.699118,S,"Allen,",Mr.,1,2
5,0,3,"Moran, Mr. James",1,29.699118,0,0,330877,8.4583,29.699118,Q,"Moran,",Mr.,1,2
6,0,1,"McCarthy, Mr. Timothy J",1,54.000000,0,0,17463,51.8625,E46,S,"McCarthy,",Mr.,0,3
7,0,3,"Palsson, Master. Gosta Leonard",1,2.000000,3,1,349909,21.0750,29.699118,S,"Palsson,",Master.,1,1
8,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",0,27.000000,0,2,347742,11.1333,29.699118,S,"Johnson,",Mrs.,0,2
9,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",0,14.000000,1,0,237736,30.0708,29.699118,C,"Nasser,",Mrs.,0,1

In [ ]:
#numerical type
numerical=["int16","int32","int64","float16","float32","float64"]
df_nume=df.select_dtypes(include=numerical)

In [ ]:
df_nume.head(10)

,Survived,Pclass,Gender,Age,SibSp,Parch,Fare,Third&Men,Age Group
0,0,3,1,22.000000,1,0,7.2500,1,2
1,1,1,0,38.000000,1,0,71.2833,0,2
2,1,3,0,26.000000,0,0,7.9250,0,2
3,1,1,0,35.000000,1,0,53.1000,0,2
4,0,3,1,35.000000,0,0,8.0500,1,2
5,0,3,1,29.699118,0,0,8.4583,1,2
6,0,1,1,54.000000,0,0,51.8625,0,3
7,0,3,1,2.000000,3,1,21.0750,1,1
8,1,3,0,27.000000,0,2,11.1333,0,2
9,1,2,0,14.000000,1,0,30.0708,0,1

In [ ]:
#Categorical type
df_cat=df.select_dtypes(include=["object"])

In [ ]:
df_cat.head(10)

,Full Name,Ticket,Cabin,Embarked,Last Name,First name
0,"Braund, Mr. Owen Harris",A/5 21171,29.699118,S,"Braund,",Mr.
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",PC 17599,C85,C,"Cumings,",Mrs.
2,"Heikkinen, Miss. Laina",STON/O2. 3101282,29.699118,S,"Heikkinen,",Miss.
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",113803,C123,S,"Futrelle,",Mrs.
4,"Allen, Mr. William Henry",373450,29.699118,S,"Allen,",Mr.
5,"Moran, Mr. James",330877,29.699118,Q,"Moran,",Mr.
6,"McCarthy, Mr. Timothy J",17463,E46,S,"McCarthy,",Mr.
7,"Palsson, Master. Gosta Leonard",349909,29.699118,S,"Palsson,",Master.
8,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",347742,29.699118,S,"Johnson,",Mrs.
9,"Nasser, Mrs. Nicholas (Adele Achem)",237736,29.699118,C,"Nasser,",Mrs.

In [ ]:
df.head(10)

,Survived,Pclass,Full Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Last Name,First name,Third&Men,Age Group
0,0,3,"Braund, Mr. Owen Harris",1,22.000000,1,0,A/5 21171,7.2500,29.699118,S,"Braund,",Mr.,1,2
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.000000,1,0,PC 17599,71.2833,C85,C,"Cumings,",Mrs.,0,2
2,1,3,"Heikkinen, Miss. Laina",0,26.000000,0,0,STON/O2. 3101282,7.9250,29.699118,S,"Heikkinen,",Miss.,0,2
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.000000,1,0,113803,53.1000,C123,S,"Futrelle,",Mrs.,0,2
4,0,3,"Allen, Mr. William Henry",1,35.000000,0,0,373450,8.0500,29.699118,S,"Allen,",Mr.,1,2
5,0,3,"Moran, Mr. James",1,29.699118,0,0,330877,8.4583,29.699118,Q,"Moran,",Mr.,1,2
6,0,1,"McCarthy, Mr. Timothy J",1,54.000000,0,0,17463,51.8625,E46,S,"McCarthy,",Mr.,0,3
7,0,3,"Palsson, Master. Gosta Leonard",1,2.000000,3,1,349909,21.0750,29.699118,S,"Palsson,",Master.,1,1
8,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",0,27.000000,0,2,347742,11.1333,29.699118,S,"Johnson,",Mrs.,0,2
9,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",0,14.000000,1,0,237736,30.0708,29.699118,C,"Nasser,",Mrs.,0,1

# iloc vs loc

In [ ]:
#iloc
df_sub=df.iloc[1:4,2:5]

In [ ]:
df_sub

                                           Full Name  Gender   Age
1  Cumings, Mrs. John Bradley (Florence Briggs Th...       0  38.0
2                             Heikkinen, Miss. Laina       0  26.0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)       0  35.0

In [ ]:
#loc
df_sub1=df.loc[1:4,["Full Name","Age"]]

In [ ]:
df_sub1

                                           Full Name   Age
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                             Heikkinen, Miss. Laina  26.0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4                           Allen, Mr. William Henry  35.0

# Add Row

In [ ]:
row=dict({"Age":50,"Full Name":"Anika"})

In [ ]:
df=pd.concat([df,pd.DataFrame([row])],ignore_index=True)

In [ ]:
df.tail()

/usr/local/lib/python3.11/dist-packages/pandas/io/formats/format.py:1458: RuntimeWarning: invalid value encountered in greater
  has_large_values = (abs_vals > 1e6).any()
/usr/local/lib/python3.11/dist-packages/pandas/io/formats/format.py:1459: RuntimeWarning: invalid value encountered in less
  has_small_values = ((abs_vals < 10 ** (-self.digits)) & (abs_vals > 0)).any()
/usr/local/lib/python3.11/dist-packages/pandas/io/formats/format.py:1459: RuntimeWarning: invalid value encountered in greater
  has_small_values = ((abs_vals < 10 ** (-self.digits)) & (abs_vals > 0)).any()

,Survived,Pclass,Full Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Last Name,First name,Third&Men,Age Group
887,1.0,1.0,"Graham, Miss. Margaret Edith",0.0,19.000000,0.0,0.0,112053,30.00,B42,S,"Graham,",Miss.,0.0,2.0
888,0.0,3.0,"Johnston, Miss. Catherine Helen ""Carrie""",0.0,29.699118,1.0,2.0,W./C. 6607,23.45,29.699118,S,"Johnston,",Miss.,0.0,2.0
889,1.0,1.0,"Behr, Mr. Karl Howell",1.0,26.000000,0.0,0.0,111369,30.00,C148,C,"Behr,",Mr.,0.0,2.0
890,0.0,3.0,"Dooley, Mr. Patrick",1.0,32.000000,0.0,0.0,370376,7.75,29.699118,Q,"Dooley,",Mr.,1.0,2.0
891,NaN,NaN,Anika,NaN,50.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN